#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/KrisCo/Lab-development/runs/run-nXkJshKXkaKr2Yfn

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
aws_vpc.vpc-practice: Refreshing state... [id=vpc-097770e1d6695336a]
aws_internet_gateway.igw-example: Refreshing state... [id=igw-054272837dda574c8]
aws_subnet.public-example-subnet: Refreshing state... [id=subnet-0626810e8f0e053fd]
aws_security_group.webserver-SG: Refreshing state... [id=sg-092ad040d35d0e60a]
aws_route_table.public-practice-RT: Refreshing state... [id=rtb-0c327b0baa8fa855b]
aws_instance.EC2: Refreshing state... [id=i-073bc285b30fceea5]
aws_route_table_association.public-access: Refreshing state... [id=rtbassoc-0bd0da815058a50c6]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_instance.EC2 must be replaced
-/+ resource "aws_instance" "EC2" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:949471431711:instance/i-073bc285b30fceea5" -> (known after apply)
      ~ associate_public_ip_address          = true -> (known after apply)
      ~ availability_zone                    = "us-east-1a" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-073bc285b30fceea5" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-00f1cccd9e646237e" -> (known after apply)
      ~ private_dns                          = "ip-142-55-1-19.ec2.internal" -> (known after apply)
      ~ private_ip                           = "142.55.1.19" -> (known after apply)
      ~ public_dns                           = "ec2-54-211-70-23.compute-1.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "54.211.70.23" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] # forces replacement -> (known after apply)
      ~ subnet_id                            = "subnet-0626810e8f0e053fd" # forces replacement -> (known after apply)
      ~ tags                                 = {
          ~ "Name" = "Ec2-terraformed" -> "EC2-development"
        }
      ~ tags_all                             = {
          ~ "Name" = "Ec2-terraformed" -> "EC2-development"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-092ad040d35d0e60a",
        ] -> (known after apply)
        # (7 unchanged attributes hidden)

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0f423336019e59d0b" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }
    }

  # aws_internet_gateway.igw-example will be updated in-place
  ~ resource "aws_internet_gateway" "igw-example" {
        id       = "igw-054272837dda574c8"
        tags     = {
            "Name" = "igw-example"
        }
      ~ vpc_id   = "vpc-097770e1d6695336a" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_route_table.public-practice-RT must be replaced
-/+ resource "aws_route_table" "public-practice-RT" {
      ~ arn              = "arn:aws:ec2:us-east-1:949471431711:route-table/rtb-0c327b0baa8fa855b" -> (known after apply)
      ~ id               = "rtb-0c327b0baa8fa855b" -> (known after apply)
      ~ owner_id         = "949471431711" -> (known after apply)
      ~ propagating_vgws = [] -> (known after apply)
        tags             = {
            "Name" = "ex_public_rt"
        }
      ~ vpc_id           = "vpc-097770e1d6695336a" # forces replacement -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_route_table_association.public-access must be replaced
-/+ resource "aws_route_table_association" "public-access" {
      ~ id             = "rtbassoc-0bd0da815058a50c6" -> (known after apply)
      ~ route_table_id = "rtb-0c327b0baa8fa855b" -> (known after apply)
      ~ subnet_id      = "subnet-0626810e8f0e053fd" # forces replacement -> (known after apply)
    }

  # aws_security_group.webserver-SG must be replaced
-/+ resource "aws_security_group" "webserver-SG" {
      ~ arn                    = "arn:aws:ec2:us-east-1:949471431711:security-group/sg-092ad040d35d0e60a" -> (known after apply)
      ~ id                     = "sg-092ad040d35d0e60a" -> (known after apply)
        name                   = "webserver-SG"
      + name_prefix            = (known after apply)
      ~ owner_id               = "949471431711" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      ~ vpc_id                 = "vpc-097770e1d6695336a" # forces replacement -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_subnet.public-example-subnet must be replaced
-/+ resource "aws_subnet" "public-example-subnet" {
      ~ arn                                            = "arn:aws:ec2:us-east-1:949471431711:subnet/subnet-0626810e8f0e053fd" -> (known after apply)
      ~ availability_zone_id                           = "use1-az2" -> (known after apply)
      ~ id                                             = "subnet-0626810e8f0e053fd" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "949471431711" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
        tags                                           = {
            "Name" = "example-SN-public"
        }
      ~ vpc_id                                         = "vpc-097770e1d6695336a" # forces replacement -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # aws_vpc.lab will be created
  + resource "aws_vpc" "lab" {
      + arn                                  = (known after apply)
      + cidr_block                           = "142.55.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "vpc-development"
        }
      + tags_all                             = {
          + "Name" = "vpc-development"
        }
    }

  # aws_vpc.vpc-practice will be destroyed
  # (because aws_vpc.vpc-practice is not in configuration)
  - resource "aws_vpc" "vpc-practice" {
      - arn                                  = "arn:aws:ec2:us-east-1:949471431711:vpc/vpc-097770e1d6695336a" -> null
      - assign_generated_ipv6_cidr_block     = false -> null
      - cidr_block                           = "142.55.0.0/16" -> null
      - default_network_acl_id               = "acl-01936f4b990d077ca" -> null
      - default_route_table_id               = "rtb-0dac28ef4b177887a" -> null
      - default_security_group_id            = "sg-0d5137c1332ccee80" -> null
      - dhcp_options_id                      = "dopt-012baeb9d34749847" -> null
      - enable_classiclink                   = false -> null
      - enable_classiclink_dns_support       = false -> null
      - enable_dns_hostnames                 = true -> null
      - enable_dns_support                   = true -> null
      - enable_network_address_usage_metrics = false -> null
      - id                                   = "vpc-097770e1d6695336a" -> null
      - instance_tenancy                     = "default" -> null
      - ipv6_netmask_length                  = 0 -> null
      - main_route_table_id                  = "rtb-0dac28ef4b177887a" -> null
      - owner_id                             = "949471431711" -> null
      - tags                                 = {
          - "Name" = "vpc-development"
        } -> null
      - tags_all                             = {
          - "Name" = "vpc-development"
        } -> null
    }

Plan: 6 to add, 1 to change, 6 to destroy.

Changes to Outputs:
  ~ web-address = "ec2-54-211-70-23.compute-1.amazonaws.com" -> (known after apply)

```

</details>

*Pushed by: @krispigeau, Action: `pull_request`*